{
  "meta.title": "PocketCode — Tu entorno de desarrollo, en tu bolsillo.",
  "meta.description": "Accede a tu entorno de desarrollo VS Code de escritorio desde el móvil. Usa agentes de IA como Claude, Codex y Gemini tal como lo harías en el escritorio.",
  "og.description": "Accede a tu entorno VS Code de escritorio desde el móvil.",
  "nav.screenshots": "Capturas",
  "nav.features": "Funciones",
  "hero.tagline": "Tu entorno de desarrollo, en tu bolsillo.<br/>Accede a tu VS Code de escritorio desde el móvil.<br/><code>Claude</code> <code>Codex</code> <code>Gemini</code> —<br/>Agentes de IA, como en el escritorio.",
  "hero.appstore": "Próximamente en App Store",
  "hero.playstore": "Próximamente en Google Play",
  "screenshots.label": "Capturas",
  "screenshots.title": "Registra un host,<br/>empieza a programar.",
  "screenshots.subtitle": "Registra tu servidor de desarrollo y conéctate directamente a cualquier carpeta.",
  "screenshots.caption1.title": "Agente IA",
  "screenshots.caption1.desc": "Usa Claude Code en el móvil",
  "screenshots.caption2.title": "Editor VS Code",
  "screenshots.caption2.desc": "Tu entorno familiar",
  "screenshots.caption3.title": "Lista de hosts",
  "screenshots.caption3.desc": "Todos tus servidores de un vistazo",
  "features.label": "Funciones",
  "features.title": "Más allá del navegador.",
  "features.subtitle": "Completamente diferente a abrir vscode.dev en Safari.<br/>Un cliente nativo de desarrollo remoto móvil.",
  "features.ai.name": "Agentes IA, intactos",
  "features.ai.desc": "Al traer tu entorno de desarrollo de escritorio tal cual, los agentes de IA como Claude, Codex y Gemini funcionan directamente desde tu móvil.",
  "features.host.name": "Gestión de hosts",
  "features.host.desc": "Registra y gestiona múltiples servidores de desarrollo. Compatible con VS Code Tunnel y serve-web.",
  "features.zero.name": "Conexión sin instalación",
  "features.zero.desc": "Sin software adicional en tu escritorio. Se conecta mediante la función de túnel integrada de VS Code, con toda la autenticación dentro de la app.",
  "features.bio.name": "Bloqueo biométrico",
  "features.bio.desc": "Protege tu app con Face ID o Touch ID. Configura los momentos de bloqueo: al iniciar la app, al volver del segundo plano, y más.",
  "features.siri.name": "Atajos de Siri",
  "features.siri.desc": "Di \"Conectar a PocketCode\" para acceder a tu host favorito al instante. Añade atajos a tu pantalla de inicio para acceso con un toque.",
  "features.conn.name": "Monitoreo de conexión",
  "features.conn.desc": "Monitoreo de red en tiempo real que detecta desconexiones al instante. Las conexiones inestables se reconectan automáticamente.",
  "footer.feedback": "Comentarios y soporte",
  "footer.home": "Inicio",
  "privacy.meta.title": "Política de privacidad — PocketCode",
  "privacy.meta.description": "Política de privacidad de la aplicación PocketCode",
  "privacy.title": "Política de privacidad",
  "privacy.effective.date": "Vigente desde: 18 de febrero de 2026",
  "privacy.highlight": "<strong>PocketCode no recopila ni transmite tus datos personales a servidores externos.</strong> Todos los datos se almacenan únicamente en tu dispositivo, y el desarrollador de la app no tiene acceso a ellos.",
  "privacy.s1.title": "1. Información que procesamos",
  "privacy.s1.intro": "PocketCode procesa la siguiente información <strong>únicamente en tu dispositivo</strong> para proporcionar las funciones de la app.",
  "privacy.s1.item1": "<strong>Configuración de host</strong> — Nombre, dirección, puerto y tipo de conexión de los servidores registrados",
  "privacy.s1.item2": "<strong>Carpetas recientes</strong> — Rutas de carpetas y tiempos de último acceso",
  "privacy.s1.item3": "<strong>Datos de autenticación</strong> — Cookies OAuth de GitHub o Microsoft (gestionadas por WebKit)",
  "privacy.s1.item4": "<strong>Tokens de conexión</strong> — Tokens de acceso para hosts serve-web (cifrados en el Llavero de iOS)",
  "privacy.s1.item5": "<strong>Configuración de bloqueo</strong> — Preferencias de autenticación biométrica y temporización del bloqueo",
  "privacy.s2.title": "2. Dónde se almacenan los datos",
  "privacy.s2.intro": "Todos los datos se almacenan en tu dispositivo y nunca se transmiten a servidores externos.",
  "privacy.s2.item1": "<strong>Base de datos del dispositivo</strong> (SwiftData) — Lista de hosts, carpetas recientes",
  "privacy.s2.item2": "<strong>Llavero de iOS</strong> — Tokens de conexión (cifrados por iOS)",
  "privacy.s2.item3": "<strong>Almacenamiento WebKit</strong> — Cookies de autenticación, caché del editor VS Code",
  "privacy.s2.item4": "<strong>UserDefaults</strong> — Bloqueo de app y otras preferencias",
  "privacy.s3.title": "3. Servicios externos",
  "privacy.s3.intro": "PocketCode se conecta directamente a los siguientes servicios. Esto es para funcionalidad principal, no para análisis ni seguimiento.",
  "privacy.s3.item1": "<strong>vscode.dev</strong> — Interfaz del editor web VS Code",
  "privacy.s3.item2": "<strong>github.com</strong> — Autenticación de cuenta GitHub",
  "privacy.s3.item3": "<strong>login.microsoftonline.com</strong> — Autenticación de cuenta Microsoft",
  "privacy.s3.item4": "<strong>Servidores de desarrollo registrados</strong> — Conexiones VS Code Tunnel o serve-web",
  "privacy.s3.outro": "PocketCode no utiliza <strong>ningún SDK de análisis o informes de errores de terceros</strong> como Firebase, Amplitude o Sentry.",
  "privacy.s4.title": "4. Autenticación biométrica",
  "privacy.s4.text": "PocketCode puede usar Face ID o Touch ID para el bloqueo de la app. Los datos biométricos son procesados por iOS; PocketCode no almacena ni accede directamente a la información biométrica. Solo se verifica el resultado de la autenticación (éxito o fallo) dentro de la app.",
  "privacy.s5.title": "5. Información que no recopilamos",
  "privacy.s5.intro": "PocketCode no recopila la siguiente información.",
  "privacy.s5.item1": "Datos de ubicación",
  "privacy.s5.item2": "Datos de cámara o micrófono",
  "privacy.s5.item3": "Contactos, fotos o calendario",
  "privacy.s5.item4": "Identificadores publicitarios (IDFA)",
  "privacy.s5.item5": "Contenido del código que escribes o editas",
  "privacy.s5.item6": "Patrones de uso del dispositivo o análisis de comportamiento",
  "privacy.s6.title": "6. Eliminación de datos",
  "privacy.s6.intro": "Puedes eliminar tus datos en cualquier momento dentro de la app.",
  "privacy.s6.item1": "Eliminar host — Elimina la configuración del host, tokens de conexión e historial de carpetas recientes.",
  "privacy.s6.item2": "Cerrar sesión — Elimina las cookies de autenticación de GitHub o Microsoft.",
  "privacy.s6.item3": "Borrar caché — Borra la caché de WebKit desde ajustes.",
  "privacy.s6.item4": "Eliminar app — Desinstalar la app elimina todos los datos completamente de tu dispositivo.",
  "privacy.s7.title": "7. Privacidad infantil",
  "privacy.s7.text": "PocketCode no recopila intencionalmente información personal de menores de 14 años.",
  "privacy.s8.title": "8. Cambios",
  "privacy.s8.text": "Esta política de privacidad puede actualizarse según sea necesario. Los cambios se publicarán en esta página con una fecha de vigencia actualizada.",
  "privacy.s9.title": "9. Contacto",
  "privacy.s9.text": "Si tienes preguntas sobre esta política de privacidad, contáctanos a través de <a href=\"https://github.com/pocketcode-app/support\" target=\"_blank\" rel=\"noopener\">GitHub</a>."
}
