{
  "meta.title": "PocketCode — Votre environnement de dev, dans votre poche.",
  "meta.description": "Accédez à votre environnement VS Code de bureau depuis votre mobile. Utilisez des agents IA comme Claude, Codex et Gemini comme sur votre ordinateur.",
  "og.description": "Accédez à votre environnement VS Code de bureau depuis votre mobile.",
  "nav.screenshots": "Captures",
  "nav.features": "Fonctionnalités",
  "hero.tagline": "Votre environnement de dev, dans votre poche.<br/>Accédez à votre VS Code de bureau depuis votre mobile.<br/><code>Claude</code> <code>Codex</code> <code>Gemini</code> —<br/>Les agents IA, comme sur le bureau.",
  "hero.appstore": "Bientôt sur l'App Store",
  "hero.playstore": "Bientôt sur Google Play",
  "screenshots.label": "Captures",
  "screenshots.title": "Enregistrez un hôte,<br/>commencez à coder.",
  "screenshots.subtitle": "Enregistrez votre serveur de développement et connectez-vous directement à n'importe quel dossier.",
  "screenshots.caption1.title": "Agent IA",
  "screenshots.caption1.desc": "Utilisez Claude Code sur mobile",
  "screenshots.caption2.title": "Éditeur VS Code",
  "screenshots.caption2.desc": "Votre environnement familier",
  "screenshots.caption3.title": "Liste des hôtes",
  "screenshots.caption3.desc": "Tous vos serveurs en un coup d'œil",
  "features.label": "Fonctionnalités",
  "features.title": "Au-delà du navigateur.",
  "features.subtitle": "Bien au-delà d'ouvrir vscode.dev dans Safari.<br/>Un client natif de développement distant mobile.",
  "features.ai.name": "Agents IA, intacts",
  "features.ai.desc": "En apportant votre environnement de bureau tel quel, les agents IA comme Claude, Codex et Gemini fonctionnent directement depuis votre mobile.",
  "features.host.name": "Gestion des hôtes",
  "features.host.desc": "Enregistrez et gérez plusieurs serveurs de développement. Compatible avec VS Code Tunnel et serve-web.",
  "features.zero.name": "Connexion sans installation",
  "features.zero.desc": "Aucun logiciel supplémentaire sur votre bureau. Se connecte via la fonction tunnel intégrée de VS Code, avec toute l'authentification dans l'app.",
  "features.bio.name": "Verrouillage biométrique",
  "features.bio.desc": "Protégez votre app avec Face ID ou Touch ID. Réglez finement le moment du verrouillage : au lancement, au retour de l'arrière-plan, et plus.",
  "features.siri.name": "Raccourcis Siri",
  "features.siri.desc": "Dites « Se connecter à PocketCode » pour accéder instantanément à votre hôte favori. Ajoutez des raccourcis à votre écran d'accueil pour un accès en un tap.",
  "features.conn.name": "Surveillance de connexion",
  "features.conn.desc": "La surveillance réseau en temps réel détecte instantanément les déconnexions. Les connexions instables sont automatiquement rétablies.",
  "footer.feedback": "Contact et support",
  "footer.home": "Accueil",
  "privacy.meta.title": "Politique de confidentialité — PocketCode",
  "privacy.meta.description": "Politique de confidentialité de l'application PocketCode",
  "privacy.title": "Politique de confidentialité",
  "privacy.effective.date": "Date d'effet : 18 février 2026",
  "privacy.highlight": "<strong>PocketCode ne collecte ni ne transmet vos données personnelles vers des serveurs externes.</strong> Toutes les données sont stockées uniquement sur votre appareil, et le développeur n'y a pas accès.",
  "privacy.s1.title": "1. Informations traitées",
  "privacy.s1.intro": "PocketCode traite les informations suivantes <strong>uniquement sur votre appareil</strong> pour fournir les fonctionnalités de l'app.",
  "privacy.s1.item1": "<strong>Configuration des hôtes</strong> — Nom, adresse, port et type de connexion des serveurs enregistrés",
  "privacy.s1.item2": "<strong>Dossiers récents</strong> — Chemins des dossiers et heures de dernier accès",
  "privacy.s1.item3": "<strong>Données d'authentification</strong> — Cookies OAuth de GitHub ou Microsoft (gérés par WebKit)",
  "privacy.s1.item4": "<strong>Jetons de connexion</strong> — Jetons d'accès pour les hôtes serve-web (chiffrés dans le trousseau iOS)",
  "privacy.s1.item5": "<strong>Paramètres de verrouillage</strong> — Préférences d'authentification biométrique et minutage du verrouillage",
  "privacy.s2.title": "2. Où sont stockées les données",
  "privacy.s2.intro": "Toutes les données sont stockées sur votre appareil et ne sont jamais transmises à des serveurs externes.",
  "privacy.s2.item1": "<strong>Base de données locale</strong> (SwiftData) — Liste des hôtes, dossiers récents",
  "privacy.s2.item2": "<strong>Trousseau iOS</strong> — Jetons de connexion (chiffrés par iOS)",
  "privacy.s2.item3": "<strong>Stockage WebKit</strong> — Cookies d'authentification, cache de l'éditeur VS Code",
  "privacy.s2.item4": "<strong>UserDefaults</strong> — Verrouillage de l'app et autres préférences",
  "privacy.s3.title": "3. Services externes",
  "privacy.s3.intro": "PocketCode se connecte directement aux services suivants. Ceci est pour les fonctionnalités principales, pas pour l'analyse ou le suivi.",
  "privacy.s3.item1": "<strong>vscode.dev</strong> — Interface de l'éditeur web VS Code",
  "privacy.s3.item2": "<strong>github.com</strong> — Authentification du compte GitHub",
  "privacy.s3.item3": "<strong>login.microsoftonline.com</strong> — Authentification du compte Microsoft",
  "privacy.s3.item4": "<strong>Serveurs de développement enregistrés</strong> — Connexions VS Code Tunnel ou serve-web",
  "privacy.s3.outro": "PocketCode n'utilise <strong>aucun SDK tiers d'analyse ou de rapports d'erreurs</strong> tel que Firebase, Amplitude ou Sentry.",
  "privacy.s4.title": "4. Authentification biométrique",
  "privacy.s4.text": "PocketCode peut utiliser Face ID ou Touch ID pour le verrouillage de l'app. Les données biométriques sont traitées par iOS ; PocketCode ne stocke ni n'accède directement aux informations biométriques. Seul le résultat de l'authentification (succès ou échec) est vérifié dans l'app.",
  "privacy.s5.title": "5. Informations non collectées",
  "privacy.s5.intro": "PocketCode ne collecte pas les informations suivantes.",
  "privacy.s5.item1": "Données de localisation",
  "privacy.s5.item2": "Données de caméra ou microphone",
  "privacy.s5.item3": "Contacts, photos ou calendrier",
  "privacy.s5.item4": "Identifiants publicitaires (IDFA)",
  "privacy.s5.item5": "Contenu du code que vous écrivez ou modifiez",
  "privacy.s5.item6": "Habitudes d'utilisation de l'appareil ou analyses comportementales",
  "privacy.s6.title": "6. Suppression des données",
  "privacy.s6.intro": "Vous pouvez supprimer vos données à tout moment dans l'app.",
  "privacy.s6.item1": "Supprimer un hôte — Supprime la configuration, les jetons et l'historique des dossiers récents.",
  "privacy.s6.item2": "Déconnexion — Supprime les cookies d'authentification GitHub ou Microsoft.",
  "privacy.s6.item3": "Vider le cache — Supprimez le cache WebKit depuis les paramètres.",
  "privacy.s6.item4": "Supprimer l'app — Désinstaller l'app supprime toutes les données de votre appareil.",
  "privacy.s7.title": "7. Confidentialité des enfants",
  "privacy.s7.text": "PocketCode ne collecte pas intentionnellement d'informations personnelles d'enfants de moins de 14 ans.",
  "privacy.s8.title": "8. Modifications",
  "privacy.s8.text": "Cette politique de confidentialité peut être mise à jour si nécessaire. Les modifications seront publiées sur cette page avec une date d'effet mise à jour.",
  "privacy.s9.title": "9. Contact",
  "privacy.s9.text": "Si vous avez des questions sur cette politique de confidentialité, contactez-nous via <a href=\"https://github.com/pocketcode-app/support\" target=\"_blank\" rel=\"noopener\">GitHub</a>."
}
