{
  "meta.title": "PocketCode — Seu ambiente de dev, no seu bolso.",
  "meta.description": "Acesse seu ambiente VS Code do desktop pelo celular. Use agentes de IA como Claude, Codex e Gemini como faria no desktop.",
  "og.description": "Acesse seu ambiente VS Code do desktop pelo celular.",
  "nav.screenshots": "Capturas",
  "nav.features": "Recursos",
  "hero.tagline": "Seu ambiente de dev, no seu bolso.<br/>Acesse seu VS Code do desktop pelo celular.<br/><code>Claude</code> <code>Codex</code> <code>Gemini</code> —<br/>Agentes de IA, como no desktop.",
  "hero.appstore": "Em breve na App Store",
  "hero.playstore": "Em breve no Google Play",
  "screenshots.label": "Capturas",
  "screenshots.title": "Registre um host,<br/>comece a programar.",
  "screenshots.subtitle": "Registre seu servidor de desenvolvimento e conecte-se diretamente a qualquer pasta.",
  "screenshots.caption1.title": "Agente IA",
  "screenshots.caption1.desc": "Use Claude Code no celular",
  "screenshots.caption2.title": "Editor VS Code",
  "screenshots.caption2.desc": "Seu ambiente familiar",
  "screenshots.caption3.title": "Lista de hosts",
  "screenshots.caption3.desc": "Todos os seus servidores de uma vez",
  "features.label": "Recursos",
  "features.title": "Além do navegador.",
  "features.subtitle": "Completamente diferente de abrir vscode.dev no Safari.<br/>Um cliente nativo de desenvolvimento remoto mobile.",
  "features.ai.name": "Agentes IA, intactos",
  "features.ai.desc": "Como seu ambiente de desenvolvimento do desktop é trazido como está, agentes de IA como Claude, Codex e Gemini funcionam diretamente do seu celular.",
  "features.host.name": "Gerenciamento de hosts",
  "features.host.desc": "Registre e gerencie múltiplos servidores de desenvolvimento. Suporta tanto VS Code Tunnel quanto serve-web.",
  "features.zero.name": "Conexão sem instalação",
  "features.zero.desc": "Sem software extra no desktop. Conecta-se via recurso de túnel integrado do VS Code, com toda a autenticação dentro do app.",
  "features.bio.name": "Bloqueio biométrico",
  "features.bio.desc": "Proteja seu app com Face ID ou Touch ID. Ajuste fino do momento de bloqueio: ao abrir o app, ao voltar do segundo plano, e mais.",
  "features.siri.name": "Atalhos da Siri",
  "features.siri.desc": "Diga \"Conectar ao PocketCode\" para acessar seu host favorito instantaneamente. Adicione atalhos à tela inicial para acesso com um toque.",
  "features.conn.name": "Monitoramento de conexão",
  "features.conn.desc": "Monitoramento de rede em tempo real detecta desconexões instantaneamente. Conexões instáveis são reconectadas automaticamente.",
  "footer.feedback": "Feedback e suporte",
  "footer.home": "Início",
  "privacy.meta.title": "Política de Privacidade — PocketCode",
  "privacy.meta.description": "Política de Privacidade do aplicativo PocketCode",
  "privacy.title": "Política de Privacidade",
  "privacy.effective.date": "Vigente a partir de: 18 de fevereiro de 2026",
  "privacy.highlight": "<strong>O PocketCode não coleta nem transmite seus dados pessoais para servidores externos.</strong> Todos os dados são armazenados apenas no seu dispositivo, e o desenvolvedor do app não tem acesso a eles.",
  "privacy.s1.title": "1. Informações que processamos",
  "privacy.s1.intro": "O PocketCode processa as seguintes informações <strong>apenas no seu dispositivo</strong> para fornecer as funcionalidades do app.",
  "privacy.s1.item1": "<strong>Configuração de host</strong> — Nome, endereço, porta e tipo de conexão dos servidores registrados",
  "privacy.s1.item2": "<strong>Pastas recentes</strong> — Caminhos de pastas e horários de último acesso",
  "privacy.s1.item3": "<strong>Dados de autenticação</strong> — Cookies OAuth do GitHub ou Microsoft (gerenciados pelo WebKit)",
  "privacy.s1.item4": "<strong>Tokens de conexão</strong> — Tokens de acesso para hosts serve-web (criptografados no Chaveiro do iOS)",
  "privacy.s1.item5": "<strong>Configurações de bloqueio</strong> — Preferências de autenticação biométrica e temporização do bloqueio",
  "privacy.s2.title": "2. Onde os dados são armazenados",
  "privacy.s2.intro": "Todos os dados são armazenados no seu dispositivo e nunca são transmitidos para servidores externos.",
  "privacy.s2.item1": "<strong>Banco de dados do dispositivo</strong> (SwiftData) — Lista de hosts, pastas recentes",
  "privacy.s2.item2": "<strong>Chaveiro do iOS</strong> — Tokens de conexão (criptografados pelo iOS)",
  "privacy.s2.item3": "<strong>Armazenamento WebKit</strong> — Cookies de autenticação, cache do editor VS Code",
  "privacy.s2.item4": "<strong>UserDefaults</strong> — Bloqueio do app e outras preferências",
  "privacy.s3.title": "3. Serviços externos",
  "privacy.s3.intro": "O PocketCode se conecta diretamente aos seguintes serviços. Isso é para funcionalidade principal, não para análise ou rastreamento.",
  "privacy.s3.item1": "<strong>vscode.dev</strong> — Interface do editor web VS Code",
  "privacy.s3.item2": "<strong>github.com</strong> — Autenticação de conta GitHub",
  "privacy.s3.item3": "<strong>login.microsoftonline.com</strong> — Autenticação de conta Microsoft",
  "privacy.s3.item4": "<strong>Servidores de desenvolvimento registrados</strong> — Conexões VS Code Tunnel ou serve-web",
  "privacy.s3.outro": "O PocketCode não utiliza <strong>nenhum SDK de análise ou relatório de erros de terceiros</strong> como Firebase, Amplitude ou Sentry.",
  "privacy.s4.title": "4. Autenticação biométrica",
  "privacy.s4.text": "O PocketCode pode usar Face ID ou Touch ID para bloqueio do app. Dados biométricos são processados pelo iOS; o PocketCode não armazena nem acessa informações biométricas diretamente. Apenas o resultado da autenticação (sucesso ou falha) é verificado no app.",
  "privacy.s5.title": "5. Informações que não coletamos",
  "privacy.s5.intro": "O PocketCode não coleta as seguintes informações.",
  "privacy.s5.item1": "Dados de localização",
  "privacy.s5.item2": "Dados de câmera ou microfone",
  "privacy.s5.item3": "Contatos, fotos ou calendário",
  "privacy.s5.item4": "Identificadores de publicidade (IDFA)",
  "privacy.s5.item5": "Conteúdo do código que você escreve ou edita",
  "privacy.s5.item6": "Padrões de uso do dispositivo ou análise comportamental",
  "privacy.s6.title": "6. Exclusão de dados",
  "privacy.s6.intro": "Você pode excluir seus dados a qualquer momento dentro do app.",
  "privacy.s6.item1": "Excluir host — Remove a configuração do host, tokens de conexão e histórico de pastas recentes.",
  "privacy.s6.item2": "Sair — Remove os cookies de autenticação do GitHub ou Microsoft.",
  "privacy.s6.item3": "Limpar cache — Limpe o cache do WebKit nas configurações.",
  "privacy.s6.item4": "Excluir app — Desinstalar o app remove todos os dados completamente do seu dispositivo.",
  "privacy.s7.title": "7. Privacidade infantil",
  "privacy.s7.text": "O PocketCode não coleta intencionalmente informações pessoais de crianças menores de 14 anos.",
  "privacy.s8.title": "8. Alterações",
  "privacy.s8.text": "Esta política de privacidade pode ser atualizada conforme necessário. As alterações serão publicadas nesta página com uma data de vigência atualizada.",
  "privacy.s9.title": "9. Contato",
  "privacy.s9.text": "Se você tiver dúvidas sobre esta política de privacidade, entre em contato conosco pelo <a href=\"https://github.com/pocketcode-app/support\" target=\"_blank\" rel=\"noopener\">GitHub</a>."
}
